title: Duo User Account Deleted
id: c7c30131-1686-4d0f-9fe6-893b8c445ba3
status: experimental
description: Detects when a Duo user account is deleted.
references:
    - https://duo.com/docs/adminapi#administrator-logs
    - https://markernest.medium.com/duoreverse-a-duo-client-api-wrapper-for-red-teams-230a91b9074e
tags:
    - attack.persistence
    - attack.defense_evasion
    - attack.credential_access
    - attack.t1556.006
    - attack.impact
    - attack.t1531
author: Mark Ernest medium.com/@markernest
date: 2022/11/13
logsource:
    product: duo
detection:
    selection:
        action: 'user_delete'
    condition: selection
fields:
    - The 'object' field identifies the user account deleted.
    - The 'username' field identifies the admin that deleted the user account.
falsepositives:
    - This could be an approved operational change.
level: informational