title: Duo User Account Created
id: 907a6711-c0eb-462a-8886-602b3fef274f
status: experimental
description: Detects when a Duo user account is created.
references:
    - https://duo.com/docs/adminapi#administrator-logs
    - https://markernest.medium.com/duoreverse-a-duo-client-api-wrapper-for-red-teams-230a91b9074e
tags:
    - attack.persistence
    - attack.t1136.003
author: Mark Ernest medium.com/@markernest
date: 2022/11/13
logsource:
    product: duo
detection:
    selection:
        action: 'user_create'
    condition: selection
fields:
    - The 'object' field identifies the user account created.
    - The 'username' field identifies the admin that created the user account.
falsepositives:
    - This could be an approved operational change.
level: informational